{
  "format": "layers-model",
  "generatedBy": "keras v2.4.0",
  "convertedBy": "TensorFlow.js Converter v3.9.0",
  "modelTopology": {
    "keras_version": "2.4.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "model",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 1, 59],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_1"
            },
            "name": "input_1",
            "inbound_nodes": []
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 40,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_1",
            "inbound_nodes": [[["input_1", 0, 0, {}]]]
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d",
              "trainable": true,
              "batch_input_shape": [null, 1, 59],
              "dtype": "float32",
              "filters": 40,
              "kernel_size": [1],
              "strides": [1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1d",
            "inbound_nodes": [[["dense_1", 0, 0, {}]]]
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 80,
              "kernel_size": [10],
              "strides": [1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1d_1",
            "inbound_nodes": [[["conv1d", 0, 0, {}]]]
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 40,
              "activation": "tanh",
              "recurrent_activation": "hard_sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": { "gain": 1.0, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 1
            },
            "name": "lstm",
            "inbound_nodes": [[["input_1", 0, 0, {}]]]
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 40,
              "kernel_size": [10],
              "strides": [1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1d_2",
            "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 40,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense",
            "inbound_nodes": [[["lstm", 0, 0, {}]]]
          },
          {
            "class_name": "AveragePooling1D",
            "config": {
              "name": "average_pooling1d",
              "trainable": true,
              "dtype": "float32",
              "strides": [10],
              "pool_size": [10],
              "padding": "same",
              "data_format": "channels_last"
            },
            "name": "average_pooling1d",
            "inbound_nodes": [[["conv1d_2", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "concatenate",
              "trainable": true,
              "dtype": "float32",
              "axis": -1
            },
            "name": "concatenate",
            "inbound_nodes": [
              [
                ["dense", 0, 0, {}],
                ["average_pooling1d", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_1",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 80,
              "activation": "tanh",
              "recurrent_activation": "hard_sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": { "gain": 1.0, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.2,
              "recurrent_dropout": 0.0,
              "implementation": 1
            },
            "name": "lstm_1",
            "inbound_nodes": [[["concatenate", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 40,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_2",
            "inbound_nodes": [[["lstm_1", 0, 0, {}]]]
          }
        ],
        "input_layers": [["input_1", 0, 0]],
        "output_layers": [["dense_2", 0, 0]]
      }
    },
    "training_config": {
      "loss": "mean_absolute_error",
      "metrics": [
        [
          {
            "class_name": "MeanMetricWrapper",
            "config": {
              "name": "mean_absolute_percentage_error",
              "dtype": "float32",
              "fn": "mean_absolute_percentage_error"
            }
          }
        ]
      ],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "Adam",
          "learning_rate": 0.0010000000474974513,
          "decay": 0.0,
          "beta_1": 0.8999999761581421,
          "beta_2": 0.9990000128746033,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        { "name": "conv1d/kernel", "shape": [1, 40, 40], "dtype": "float32" },
        { "name": "conv1d/bias", "shape": [40], "dtype": "float32" },
        {
          "name": "conv1d_1/kernel",
          "shape": [10, 40, 80],
          "dtype": "float32"
        },
        { "name": "conv1d_1/bias", "shape": [80], "dtype": "float32" },
        {
          "name": "conv1d_2/kernel",
          "shape": [10, 80, 40],
          "dtype": "float32"
        },
        { "name": "conv1d_2/bias", "shape": [40], "dtype": "float32" },
        { "name": "dense/kernel", "shape": [40, 40], "dtype": "float32" },
        { "name": "dense/bias", "shape": [40], "dtype": "float32" },
        { "name": "dense_1/kernel", "shape": [59, 40], "dtype": "float32" },
        { "name": "dense_1/bias", "shape": [40], "dtype": "float32" },
        { "name": "dense_2/kernel", "shape": [80, 40], "dtype": "float32" },
        { "name": "dense_2/bias", "shape": [40], "dtype": "float32" },
        {
          "name": "lstm/lstm_cell/kernel",
          "shape": [59, 160],
          "dtype": "float32"
        },
        {
          "name": "lstm/lstm_cell/recurrent_kernel",
          "shape": [40, 160],
          "dtype": "float32"
        },
        { "name": "lstm/lstm_cell/bias", "shape": [160], "dtype": "float32" },
        {
          "name": "lstm_1/lstm_cell_1/kernel",
          "shape": [80, 320],
          "dtype": "float32"
        },
        {
          "name": "lstm_1/lstm_cell_1/recurrent_kernel",
          "shape": [80, 320],
          "dtype": "float32"
        },
        {
          "name": "lstm_1/lstm_cell_1/bias",
          "shape": [320],
          "dtype": "float32"
        }
      ]
    }
  ]
}
